apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
/****************************************************************************
 * arch/risc-v/src/bl602/hardware/rf_glb.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_BL602_HARDWARE_BL602_RF_H
#define __ARCH_RISCV_SRC_BL602_HARDWARE_BL602_RF_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "bl602_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define BL602_RF_REV_OFFSET                  0x000000  /* Silicon revision */
#define BL602_RF_FSM_CTRL_HW_OFFSET          0x000004  /* Digital Control */
#define BL602_RF_FSM_CTRL_SW_OFFSET          0x000008  /* rfsm status reg */
#define BL602_RFCTRL_HW_EN_OFFSET            0x00000c  /* Control logic switch */
#define BL602_RF_TEMP_COMP_OFFSET            0x000010  /* temp_comp */
#define BL602_RFCAL_STATUS_OFFSET            0x000014  /* rfcal_status */
#define BL602_RFCAL_STATUS2_OFFSET           0x000018  /* rfcal_status2 */
#define BL602_RFCAL_CTRLEN_OFFSET            0x00001c  /* Calibration mode register */
#define BL602_RFCAL_STATEEN_OFFSET           0x000020  /* rf calibration state enable in full cal list */
#define BL602_RF_SARADC_RESV_OFFSET          0x000024  /* SARADC Control Registers */
#define BL602_RF_BASE_CTRL1_OFFSET           0x000028  /* ZRF Control register 0 */
#define BL602_RF_BASE_CTRL2_OFFSET           0x00002c  /* ZRF Control register 0 */
#define BL602_RF_PUCR1_OFFSET                0x000030  /* pucr1 */
#define BL602_RF_PUCR1_HW_OFFSET             0x000034  /* read only from hardware logic */
#define BL602_RF_PUCR2_OFFSET                0x000038  /* pucr2 */
#define BL602_RF_PUCR2_HW_OFFSET             0x00003c  /* pucr2_hw */
#define BL602_RF_PPU_CTRL_HW_OFFSET          0x000040  /* ppu_ctrl_hw */
#define BL602_RF_TRX_GAIN1_OFFSET            0x000048  /* gain control1 */
#define BL602_RF_PUD_CTRL_HW_OFFSET          0x000044  /* pud_ctrl_hw */
#define BL602_RF_TEN_DC_OFFSET               0x000050  /* dc test register */
#define BL602_RF_TRX_GAIN_HW_OFFSET          0x00004c  /* trx gain hardware readback */
#define BL602_RF_TEN_AC_OFFSET               0x000058  /* ac test register */
#define BL602_RF_TEN_DIG_OFFSET              0x000054  /* digital test register */
#define BL602_RF_CIP_OFFSET                  0x000060  /* RX normal bias mode registers */
#define BL602_RF_PMIP_MV2AON_OFFSET          0x00005c  /* pmip_mv2aon */
#define BL602_RF_PA2_OFFSET                  0x000068  /* RX normal bias mode registers */
#define BL602_RF_PA1_OFFSET                  0x000064  /* pa1 */
#define BL602_RF_TBB_OFFSET                  0x000070  /* tbb */
#define BL602_RF_TMX_OFFSET                  0x00006c  /* tmx */
#define BL602_RF_RMXGM_OFFSET                0x000078  /* rmxgm */
#define BL602_RF_LNA_OFFSET                  0x000074  /* lna */
#define BL602_RF_RBB2_OFFSET                 0x000080  /* rbb2 */
#define BL602_RF_RBB1_OFFSET                 0x00007c  /* rbb1 */
#define BL602_RF_RBB4_OFFSET                 0x000088  /* rbb4 */
#define BL602_RF_RBB3_OFFSET                 0x000084  /* rbb3 */
#define BL602_RF_ADDA2_OFFSET                0x000090  /* adda2 */
#define BL602_RF_ADDA1_OFFSET                0x00008c  /* adda1 */
#define BL602_RF_VCO2_OFFSET                 0x0000a4  /* vco2 */
#define BL602_RF_VCO1_OFFSET                 0x0000a0  /* vco1 */
#define BL602_RF_VCO4_OFFSET                 0x0000ac  /* vco4 */
#define BL602_RF_VCO3_OFFSET                 0x0000a8  /* vco3 */
#define BL602_RF_LO_OFFSET                   0x0000b4  /* lo */
#define BL602_RF_PFDCP_OFFSET                0x0000b0  /* pfdcp */
#define BL602_RF_LODIST_OFFSET               0x0000bc  /* lodist */
#define BL602_RF_FBDV_OFFSET                 0x0000b8  /* fbdv */
#define BL602_RF_SDM2_OFFSET                 0x0000c4  /* sdm2 */
#define BL602_RF_SDM1_OFFSET                 0x0000c0  /* sdm1 */
#define BL602_RF_RESV_REG_0_OFFSET           0x0000ec  /* rf_resv_reg_0 */
#define BL602_RF_SDM3_OFFSET                 0x0000c8  /* sdm3 */
#define BL602_RF_RESV_REG_2_OFFSET           0x0000f4  /* rf_resv_reg_2 */
#define BL602_RF_RESV_REG_1_OFFSET           0x0000f0  /* rf_resv_reg_1 */
#define BL602_RRF_GAIN_INDEX2_OFFSET         0x0000fc  /* rrf_gain_index2 */
#define BL602_RRF_GAIN_INDEX1_OFFSET         0x0000f8  /* rrf_gain_index1 */
#define BL602_RF_LNA_CTRL_HW_MUX_OFFSET      0x000100  /* lna_ctrl_hw_mux */
#define BL602_RF_RBB_GAIN_INDEX1_OFFSET      0x000104  /* rbb_gain_index1 */
#define BL602_RF_RBB_GAIN_INDEX2_OFFSET      0x000108  /* rbb_gain_index2 */
#define BL602_RF_RBB_GAIN_INDEX3_OFFSET      0x00010c  /* rbb_gain_index3 */
#define BL602_RF_RBB_GAIN_INDEX4_OFFSET      0x000110  /* rbb_gain_index4 */
#define BL602_RF_RBB_GAIN_INDEX5_OFFSET      0x000114  /* rbb_gain_index5 */
#define BL602_RF_TBB_GAIN_INDEX1_OFFSET      0x000118  /* tbb_gain_index1 */
#define BL602_RF_TBB_GAIN_INDEX2_OFFSET      0x00011c  /* tbb_gain_index2 */
#define BL602_RF_TBB_GAIN_INDEX3_OFFSET      0x000120  /* tbb_gain_index3 */
#define BL602_RF_TBB_GAIN_INDEX4_OFFSET      0x000124  /* tbb_gain_index4 */
#define BL602_RF_PA_REG_CTRL_HW1_OFFSET      0x000128  /* pa_reg_ctrl_hw1 */
#define BL602_RF_PA_REG_CTRL_HW2_OFFSET      0x00012c  /* pa_reg_ctrl_hw2 */
#define BL602_RF_PA_REG_WIFI_CTRL_HW_OFFSET  0x000130  /* pa_reg_wifi_ctrl_hw */
#define BL602_RF_ADDA_REG_CTRL_HW_OFFSET     0x000134  /* adda_reg_ctrl_hw */
#define BL602_RF_LO_REG_CTRL_HW1_OFFSET      0x000138  /* lo_reg_ctrl_hw1 */
#define BL602_RF_LO_CAL_CTRL_HW1_OFFSET      0x00013c  /* lo_cal_ctrl_hw1 */
#define BL602_RF_LO_CAL_CTRL_HW2_OFFSET      0x000140  /* lo_cal_ctrl_hw2 */
#define BL602_RF_LO_CAL_CTRL_HW3_OFFSET      0x000144  /* lo_cal_ctrl_hw3 */
#define BL602_RF_LO_CAL_CTRL_HW4_OFFSET      0x000148  /* lo_cal_ctrl_hw4 */
#define BL602_RF_LO_CAL_CTRL_HW5_OFFSET      0x00014c  /* lo_cal_ctrl_hw5 */
#define BL602_RF_LO_CAL_CTRL_HW6_OFFSET      0x000150  /* lo_cal_ctrl_hw6 */
#define BL602_RF_LO_CAL_CTRL_HW7_OFFSET      0x000154  /* lo_cal_ctrl_hw7 */
#define BL602_RF_LO_CAL_CTRL_HW8_OFFSET      0x000158  /* lo_cal_ctrl_hw8 */
#define BL602_RF_LO_CAL_CTRL_HW9_OFFSET      0x00015c  /* lo_cal_ctrl_hw9 */
#define BL602_RF_LO_CAL_CTRL_HW10_OFFSET     0x000160  /* lo_cal_ctrl_hw10 */
#define BL602_RF_LO_CAL_CTRL_HW11_OFFSET     0x000164  /* lo_cal_ctrl_hw11 */
#define BL602_RF_ROSDAC_CTRL_HW1_OFFSET      0x000168  /* rosdac_ctrl_hw1 */
#define BL602_RF_ROSDAC_CTRL_HW2_OFFSET      0x00016c  /* rosdac_ctrl_hw2 */
#define BL602_RF_RXIQ_CTRL_HW1_OFFSET        0x000170  /* rxiq_ctrl_hw1 */
#define BL602_RF_RXIQ_CTRL_HW2_OFFSET        0x000174  /* rxiq_ctrl_hw2 */
#define BL602_RF_RXIQ_CTRL_HW3_OFFSET        0x000178  /* rxiq_ctrl_hw3 */
#define BL602_RF_RXIQ_CTRL_HW4_OFFSET        0x00017c  /* rxiq_ctrl_hw4 */
#define BL602_RF_TOSDAC_CTRL_HW1_OFFSET      0x000180  /* tosdac_ctrl_hw1 */
#define BL602_RF_TOSDAC_CTRL_HW2_OFFSET      0x000184  /* tosdac_ctrl_hw2 */
#define BL602_RF_TOSDAC_CTRL_HW3_OFFSET      0x000188  /* tosdac_ctrl_hw3 */
#define BL602_RF_TOSDAC_CTRL_HW4_OFFSET      0x00018c  /* tosdac_ctrl_hw4 */
#define BL602_RF_TX_IQ_GAIN_HW0_OFFSET       0x000190  /* tx_iq_gain_hw0 */
#define BL602_RF_TX_IQ_GAIN_HW1_OFFSET       0x000194  /* tx_iq_gain_hw1 */
#define BL602_RF_TX_IQ_GAIN_HW2_OFFSET       0x000198  /* tx_iq_gain_hw2 */
#define BL602_RF_TX_IQ_GAIN_HW3_OFFSET       0x00019c  /* tx_iq_gain_hw3 */
#define BL602_RF_TX_IQ_GAIN_HW4_OFFSET       0x0001a0  /* tx_iq_gain_hw4 */
#define BL602_RF_TX_IQ_GAIN_HW5_OFFSET       0x0001a4  /* tx_iq_gain_hw5 */
#define BL602_RF_TX_IQ_GAIN_HW6_OFFSET       0x0001a8  /* tx_iq_gain_hw6 */
#define BL602_RF_TX_IQ_GAIN_HW7_OFFSET       0x0001ac  /* tx_iq_gain_hw7 */
#define BL602_RF_LO_SDM_CTRL_HW1_OFFSET      0x0001b0  /* lo_sdm_ctrl_hw1 */
#define BL602_RF_LO_SDM_CTRL_HW2_OFFSET      0x0001b4  /* lo_sdm_ctrl_hw2 */
#define BL602_RF_LO_SDM_CTRL_HW3_OFFSET      0x0001b8  /* lo_sdm_ctrl_hw3 */
#define BL602_RF_LO_SDM_CTRL_HW4_OFFSET      0x0001bc  /* lo_sdm_ctrl_hw4 */
#define BL602_RF_LO_SDM_CTRL_HW5_OFFSET      0x0001c0  /* lo_sdm_ctrl_hw5 */
#define BL602_RF_LO_SDM_CTRL_HW6_OFFSET      0x0001c4  /* lo_sdm_ctrl_hw6 */
#define BL602_RF_LO_SDM_CTRL_HW7_OFFSET      0x0001c8  /* lo_sdm_ctrl_hw7 */
#define BL602_RF_LO_SDM_CTRL_HW8_OFFSET      0x0001cc  /* lo_sdm_ctrl_hw8 */
#define BL602_RF_RBB_BW_CTRL_HW_OFFSET       0x0001d0  /* rbb_bw_ctrl_hw */
#define BL602_RF_SINGEN_CTRL0_OFFSET         0x00020c  /* singen_ctrl0 */
#define BL602_RF_SINGEN_CTRL1_OFFSET         0x000210  /* singen_ctrl1 */
#define BL602_RF_SINGEN_CTRL2_OFFSET         0x000214  /* singen_ctrl2 */
#define BL602_RF_SINGEN_CTRL3_OFFSET         0x000218  /* singen_ctrl3 */
#define BL602_RF_SINGEN_CTRL4_OFFSET         0x00021c  /* singen_ctrl4 */
#define BL602_RF_RFIF_DFE_CTRL0_OFFSET       0x000220  /* rfif_dfe_ctrl0 */
#define BL602_RF_RFIF_TEST_READ_OFFSET       0x000224  /* rfif_test_read */
#define BL602_RF_RFIF_DIG_CTRL_OFFSET        0x000228  /* rfif_dig_ctrl */
#define BL602_RF_DATA_TEMP_0_OFFSET          0x00022c  /* rf_data_temp_0 */
#define BL602_RF_DATA_TEMP_1_OFFSET          0x000230  /* rf_data_temp_1 */
#define BL602_RF_DATA_TEMP_2_OFFSET          0x000234  /* rf_data_temp_2 */
#define BL602_RF_DATA_TEMP_3_OFFSET          0x000238  /* rf_data_temp_3 */
#define BL602_RF_SRAM_CTRL0_OFFSET           0x00023c  /* rf_sram_ctrl0 */
#define BL602_RF_SRAM_CTRL1_OFFSET           0x000240  /* rf_sram_ctrl1 */
#define BL602_RF_SRAM_CTRL2_OFFSET           0x000244  /* rf_sram_ctrl2 */
#define BL602_RF_SRAM_CTRL3_OFFSET           0x000248  /* rf_sram_ctrl3 */
#define BL602_RF_SRAM_CTRL4_OFFSET           0x00024c  /* rf_sram_ctrl4 */
#define BL602_RF_SRAM_CTRL5_OFFSET           0x000250  /* rf_sram_ctrl5 */
#define BL602_RF_SRAM_CTRL6_OFFSET           0x000254  /* rf_sram_ctrl6 */
#define BL602_RF_ICAL_CTRL0_OFFSET           0x000258  /* rf_ical_ctrl0 */
#define BL602_RF_ICAL_CTRL1_OFFSET           0x00025c  /* rf_ical_ctrl1 */
#define BL602_RF_ICAL_CTRL2_OFFSET           0x000260  /* rf_ical_ctrl2 */
#define BL602_RF_FSM_CTRL0_OFFSET            0x000264  /* rf_fsm_ctrl0 */
#define BL602_RF_FSM_CTRL1_OFFSET            0x000268  /* rf_fsm_ctrl1 */
#define BL602_RF_FSM_CTRL2_OFFSET            0x00026c  /* rf_fsm_ctrl2 */
#define BL602_RF_PKDET_CTRL0_OFFSET          0x000270  /* rf_pkdet_ctrl0 */
#define BL602_RF_DFE_CTRL_0_OFFSET           0x000600  /* dfe_ctrl_0 */
#define BL602_RF_DFE_CTRL_1_OFFSET           0x000604  /* dfe_ctrl_1 */
#define BL602_RF_DFE_CTRL_2_OFFSET           0x000608  /* dfe_ctrl_2 */
#define BL602_RF_DFE_CTRL_3_OFFSET           0x00060c  /* dfe_ctrl_3 */
#define BL602_RF_DFE_CTRL_4_OFFSET           0x000610  /* dfe_ctrl_4 */
#define BL602_RF_DFE_CTRL_5_OFFSET           0x000614  /* dfe_ctrl_5 */
#define BL602_RF_DFE_CTRL_6_OFFSET           0x000618  /* dfe_ctrl_6 */
#define BL602_RF_DFE_CTRL_7_OFFSET           0x00061c  /* dfe_ctrl_7 */
#define BL602_RF_DFE_CTRL_8_OFFSET           0x000620  /* dfe_ctrl_8 */
#define BL602_RF_DFE_CTRL_9_OFFSET           0x000624  /* dfe_ctrl_9 */
#define BL602_RF_DFE_CTRL_10_OFFSET          0x000628  /* dfe_ctrl_10 */
#define BL602_RF_DFE_CTRL_11_OFFSET          0x00062c  /* dfe_ctrl_11 */
#define BL602_RF_DFE_CTRL_12_OFFSET          0x000630  /* dfe_ctrl_12 */
#define BL602_RF_DFE_CTRL_13_OFFSET          0x000634  /* dfe_ctrl_13 */
#define BL602_RF_DFE_CTRL_14_OFFSET          0x000638  /* dfe_ctrl_14 */
#define BL602_RF_DFE_CTRL_15_OFFSET          0x00063c  /* dfe_ctrl_15 */
#define BL602_RF_DFE_CTRL_16_OFFSET          0x000640  /* dfe_ctrl_16 */
#define BL602_RF_DFE_CTRL_17_OFFSET          0x000644  /* dfe_ctrl_17 */
#define BL602_RF_DFE_CTRL_18_OFFSET          0x000648  /* dfe_ctrl_18 */

/* Register definitions *****************************************************/

