apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_RBB4_PKDET_OUT_LATCH                               (1 << 24)
#define RF_RBB4_PKDET_OUT_RAW                                 (1 << 20)
#define RF_RBB4_RBB_PKDET_EN_HW                               (1 << 16)
#define RF_RBB4_RBB_PKDET_OUT_RSTN_HW                         (1 << 12)
#define RF_RBB4_RBB_PKDET_EN                                  (1 << 8)
#define RF_RBB4_RBB_PKDET_OUT_RSTN                            (1 << 4)
#define RF_RBB4_RBB_PKDET_VTH_MASK                            (0x0f)

#define RF_ADDA1_ADDA_LDO_DVDD_SEL_HW_SHIFT                   (24)
#define RF_ADDA1_ADDA_LDO_DVDD_SEL_HW_MASK                    (0x07 << RF_ADDA1_ADDA_LDO_DVDD_SEL_HW_SHIFT)
#define RF_ADDA1_ADDA_LDO_DVDD_SEL_SHIFT                      (20)
#define RF_ADDA1_ADDA_LDO_DVDD_SEL_MASK                       (0x07 << RF_ADDA1_ADDA_LDO_DVDD_SEL_SHIFT)
#define RF_ADDA1_ADDA_LDO_BYPS                                (1 << 16)
#define RF_ADDA1_DAC_CLK_SYNC_INV                             (1 << 13)
#define RF_ADDA1_DAC_RCCALSEL                                 (1 << 12)
#define RF_ADDA1_DAC_CLK_SEL_SHIFT                            (8)
#define RF_ADDA1_DAC_CLK_SEL_MASK                             (0x03 << RF_ADDA1_DAC_CLK_SEL_SHIFT)
#define RF_ADDA1_DAC_BIAS_SEL_SHIFT                           (4)
#define RF_ADDA1_DAC_BIAS_SEL_MASK                            (0x03 << RF_ADDA1_DAC_BIAS_SEL_SHIFT)
#define RF_ADDA1_DAC_DVDD_SEL_MASK                            (0x03)

#define RF_ADDA2_ADC_CLK_DIV_SEL                              (1 << 28)
#define RF_ADDA2_ADC_CLK_INV                                  (1 << 24)
#define RF_ADDA2_ADC_CLK_SYNC_INV                             (1 << 20)
#define RF_ADDA2_ADC_GT_RM                                    (1 << 16)
#define RF_ADDA2_ADC_SAR_ASCAL_EN                             (1 << 12)
#define RF_ADDA2_ADC_DVDD_SEL_SHIFT                           (8)
#define RF_ADDA2_ADC_DVDD_SEL_MASK                            (0x03 << RF_ADDA2_ADC_DVDD_SEL_SHIFT)
#define RF_ADDA2_ADC_DLY_CTL_SHIFT                            (4)
#define RF_ADDA2_ADC_DLY_CTL_MASK                             (0x03 << RF_ADDA2_ADC_DLY_CTL_SHIFT)
#define RF_ADDA2_ADC_VREF_SEL_MASK                            (0x03)

#define RF_VCO1_LO_VCO_IDAC_CW_HW_SHIFT                       (24)
#define RF_VCO1_LO_VCO_IDAC_CW_HW_MASK                        (0x1f << RF_VCO1_LO_VCO_IDAC_CW_HW_SHIFT)
#define RF_VCO1_LO_VCO_IDAC_CW_SHIFT                          (16)
#define RF_VCO1_LO_VCO_IDAC_CW_MASK                           (0x1f << RF_VCO1_LO_VCO_IDAC_CW_SHIFT)
#define RF_VCO1_LO_VCO_FREQ_CW_HW_SHIFT                       (8)
#define RF_VCO1_LO_VCO_FREQ_CW_HW_MASK                        (0xff << RF_VCO1_LO_VCO_FREQ_CW_HW_SHIFT)
#define RF_VCO1_LO_VCO_FREQ_CW_MASK                           (0xff)

#define RF_VCO2_ACAL_INC_EN_HW                                (1 << 16)
#define RF_VCO2_ACAL_VCO_UD                                   (1 << 12)
#define RF_VCO2_ACAL_VREF_CW_SHIFT                            (8)
#define RF_VCO2_ACAL_VREF_CW_MASK                             (0x07 << RF_VCO2_ACAL_VREF_CW_SHIFT)
#define RF_VCO2_LO_VCO_SHORT_IDAC_FILTER                      (1 << 6)
#define RF_VCO2_LO_VCO_SHORT_VBIAS_FILTER                     (1 << 5)
#define RF_VCO2_LO_VCO_IDAC_BOOT                              (1 << 4)
#define RF_VCO2_LO_VCO_VBIAS_CW_MASK                          (0x03)

#define RF_VCO3_FCAL_CNT_OP_SHIFT                             (16)
#define RF_VCO3_FCAL_CNT_OP_MASK                              (0xffff << RF_VCO3_FCAL_CNT_OP_SHIFT)
#define RF_VCO3_FCAL_DIV_MASK                                 (0xffff)

#define RF_VCO4_FCAL_INC_VCTRL_UD_SHIFT                       (24)
#define RF_VCO4_FCAL_INC_VCTRL_UD_MASK                        (0x03 << RF_VCO4_FCAL_INC_VCTRL_UD_SHIFT)
#define RF_VCO4_FCAL_CNT_RDY                                  (1 << 20)
#define RF_VCO4_FCAL_INC_LARGE_RANGE                          (1 << 16)
#define RF_VCO4_FCAL_INC_EN_HW                                (1 << 8)
#define RF_VCO4_FCAL_CNT_START                                (1 << 4)

#define RF_PFDCP_LO_PFD_RST_CSD_HW                            (1 << 29)
#define RF_PFDCP_LO_PFD_RST_CSD                               (1 << 28)
#define RF_PFDCP_LO_PFD_RVDD_BOOST                            (1 << 24)
#define RF_PFDCP_LO_CP_HIZ                                    (1 << 20)
#define RF_PFDCP_LO_CP_OPAMP_EN                               (1 << 16)
#define RF_PFDCP_LO_CP_OTA_EN                                 (1 << 12)
#define RF_PFDCP_LO_CP_STARTUP_EN                             (1 << 8)
#define RF_PFDCP_LO_CP_SEL_HW                                 (1 << 4)
#define RF_PFDCP_LO_CP_SEL                                    (1 << 0)

#define RF_LO_SLIPPED_UP                                      (1 << 24)
#define RF_LO_SLIPPED_DN                                      (1 << 20)
#define RF_LO_LF_R4_SHORT                                     (1 << 18)
#define RF_LO_LF_R4_SHIFT                                     (16)
#define RF_LO_LF_R4_MASK                                      (0x03 << RF_LO_LF_R4_SHIFT)
#define RF_LO_LF_CZ_SHIFT                                     (14)
#define RF_LO_LF_CZ_MASK                                      (0x03 << RF_LO_LF_CZ_SHIFT)
#define RF_LO_LF_RZ_SHIFT                                     (12)
#define RF_LO_LF_RZ_MASK                                      (0x03 << RF_LO_LF_RZ_SHIFT)
#define RF_LO_LF_CZ_HW_SHIFT                                  (8)
#define RF_LO_LF_CZ_HW_MASK                                   (0x03 << RF_LO_LF_CZ_HW_SHIFT)
#define RF_LO_LF_R4_HW_SHIFT                                  (4)
#define RF_LO_LF_R4_HW_MASK                                   (0x03 << RF_LO_LF_R4_HW_SHIFT)
#define RF_LO_LF_RZ_HW_MASK                                   (0x03)

#define RF_FBDV_LO_FBDV_RST_HW                                (1 << 20)
#define RF_FBDV_LO_FBDV_RST                                   (1 << 16)
#define RF_FBDV_LO_FBDV_SEL_FB_CLK_SHIFT                      (12)
#define RF_FBDV_LO_FBDV_SEL_FB_CLK_MASK                       (0x03 << RF_FBDV_LO_FBDV_SEL_FB_CLK_SHIFT)
#define RF_FBDV_LO_FBDV_SEL_SAMPLE_CLK_SHIFT                  (8)
#define RF_FBDV_LO_FBDV_SEL_SAMPLE_CLK_MASK                   (0x03 << RF_FBDV_LO_FBDV_SEL_SAMPLE_CLK_SHIFT)
#define RF_FBDV_LO_FBDV_HALFSTEP_EN                           (1 << 4)
#define RF_FBDV_LO_FBDV_HALFSTEP_EN_HW                        (1 << 0)

#define RF_LODIST_RXBUF_STRE                                  (1 << 28)
#define RF_LODIST_TXBUF_STRE                                  (1 << 24)
#define RF_LODIST_LO_OSMX_CAP_SHIFT                           (20)
#define RF_LODIST_LO_OSMX_CAP_MASK                            (0x0f << RF_LODIST_LO_OSMX_CAP_SHIFT)
#define RF_LODIST_LO_OSMX_CAPBANK_BIAS_SHIFT                  (16)
#define RF_LODIST_LO_OSMX_CAPBANK_BIAS_MASK                   (0x03 << RF_LODIST_LO_OSMX_CAPBANK_BIAS_SHIFT)
#define RF_LODIST_LO_OSMX_VBUF_STRE                           (1 << 12)
#define RF_LODIST_LO_OSMX_FIX_CAP                             (1 << 8)
#define RF_LODIST_LO_OSMX_EN_XGM                              (1 << 4)
#define RF_LODIST_LO_OSMX_XGM_BOOST                           (1 << 0)

