apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_SDM1_LO_SDM_FLAG                                   (1 << 20)
#define RF_SDM1_LO_SDM_RSTB_HW                                (1 << 17)
#define RF_SDM1_LO_SDM_RSTB                                   (1 << 16)
#define RF_SDM1_LO_SDM_BYPASS                                 (1 << 12)
#define RF_SDM1_LO_SDM_DITHER_SEL_SHIFT                       (8)
#define RF_SDM1_LO_SDM_DITHER_SEL_MASK                        (0x03 << RF_SDM1_LO_SDM_DITHER_SEL_SHIFT)
#define RF_SDM1_LO_SDM_BYPASS_HW                              (1 << 4)
#define RF_SDM1_LO_SDM_DITHER_SEL_HW_MASK                     (0x03)

#define RF_SDM2_LO_SDMIN_MASK                                 (0x3fffffff)

#define RF_SDM3_LO_SDMIN_HW_MASK                              (0x3fffffff)

#define RRF_GAIN_INDEX1_GAIN_CTRL5_GC_LNA_SHIFT               (27)
#define RRF_GAIN_INDEX1_GAIN_CTRL5_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL5_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL5_GC_RMXGM_SHIFT             (25)
#define RRF_GAIN_INDEX1_GAIN_CTRL5_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX1_GAIN_CTRL5_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL4_GC_LNA_SHIFT               (22)
#define RRF_GAIN_INDEX1_GAIN_CTRL4_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL4_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL4_GC_RMXGM_SHIFT             (20)
#define RRF_GAIN_INDEX1_GAIN_CTRL4_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX1_GAIN_CTRL4_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL3_GC_LNA_SHIFT               (17)
#define RRF_GAIN_INDEX1_GAIN_CTRL3_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL3_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL3_GC_RMXGM_SHIFT             (15)
#define RRF_GAIN_INDEX1_GAIN_CTRL3_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX1_GAIN_CTRL3_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL2_GC_LNA_SHIFT               (12)
#define RRF_GAIN_INDEX1_GAIN_CTRL2_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL2_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL2_GC_RMXGM_SHIFT             (10)
#define RRF_GAIN_INDEX1_GAIN_CTRL2_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX1_GAIN_CTRL2_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL1_GC_LNA_SHIFT               (7)
#define RRF_GAIN_INDEX1_GAIN_CTRL1_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL1_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL1_GC_RMXGM_SHIFT             (5)
#define RRF_GAIN_INDEX1_GAIN_CTRL1_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX1_GAIN_CTRL1_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL0_GC_LNA_SHIFT               (2)
#define RRF_GAIN_INDEX1_GAIN_CTRL0_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX1_GAIN_CTRL0_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX1_GAIN_CTRL0_GC_RMXGM_MASK              (0x03)

#define RRF_GAIN_INDEX2_GAIN_CTRL6_GC_LNA_SHIFT               (12)
#define RRF_GAIN_INDEX2_GAIN_CTRL6_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX2_GAIN_CTRL6_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX2_GAIN_CTRL6_GC_RMXGM_SHIFT             (10)
#define RRF_GAIN_INDEX2_GAIN_CTRL6_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX2_GAIN_CTRL6_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX2_GAIN_CTRL7_GC_LNA_SHIFT               (7)
#define RRF_GAIN_INDEX2_GAIN_CTRL7_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX2_GAIN_CTRL7_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX2_GAIN_CTRL7_GC_RMXGM_SHIFT             (5)
#define RRF_GAIN_INDEX2_GAIN_CTRL7_GC_RMXGM_MASK              (0x03 << RRF_GAIN_INDEX2_GAIN_CTRL7_GC_RMXGM_SHIFT)
#define RRF_GAIN_INDEX2_GAIN_CTRL8_GC_LNA_SHIFT               (2)
#define RRF_GAIN_INDEX2_GAIN_CTRL8_GC_LNA_MASK                (0x07 << RRF_GAIN_INDEX2_GAIN_CTRL8_GC_LNA_SHIFT)
#define RRF_GAIN_INDEX2_GAIN_CTRL8_GC_RMXGM_MASK              (0x03)

#define RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_LG_SHIFT              (12)
#define RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_LG_MASK               (0x0f << RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_LG_SHIFT)
#define RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_HG_SHIFT              (8)
#define RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_HG_MASK               (0x0f << RF_LNA_CTRL_HW_MUX_LNA_LOAD_CSW_HG_SHIFT)
#define RF_LNA_CTRL_HW_MUX_LNA_BM_LG_SHIFT                    (4)
#define RF_LNA_CTRL_HW_MUX_LNA_BM_LG_MASK                     (0x0f << RF_LNA_CTRL_HW_MUX_LNA_BM_LG_SHIFT)
#define RF_LNA_CTRL_HW_MUX_LNA_BM_HG_MASK                     (0x0f)

#define RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB2_SHIFT           (28)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB1_SHIFT           (24)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX1_GAIN_CTRL3_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB2_SHIFT           (20)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB1_SHIFT           (16)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX1_GAIN_CTRL2_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB2_SHIFT           (12)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB1_SHIFT           (8)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX1_GAIN_CTRL1_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL0_GC_RBB2_SHIFT           (4)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL0_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX1_GAIN_CTRL0_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX1_GAIN_CTRL0_GC_RBB1_MASK            (0x03)

#define RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB2_SHIFT           (28)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB1_SHIFT           (24)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX2_GAIN_CTRL7_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB2_SHIFT           (20)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB1_SHIFT           (16)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX2_GAIN_CTRL6_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB2_SHIFT           (12)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB1_SHIFT           (8)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX2_GAIN_CTRL5_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL4_GC_RBB2_SHIFT           (4)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL4_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX2_GAIN_CTRL4_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX2_GAIN_CTRL4_GC_RBB1_MASK            (0x03)

#define RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB2_SHIFT          (28)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB1_SHIFT          (24)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB1_MASK           (0x03 << RF_RBB_GAIN_INDEX3_GAIN_CTRL11_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB2_SHIFT          (20)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB1_SHIFT          (16)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB1_MASK           (0x03 << RF_RBB_GAIN_INDEX3_GAIN_CTRL10_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB2_SHIFT           (12)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB1_SHIFT           (8)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB1_MASK            (0x03 << RF_RBB_GAIN_INDEX3_GAIN_CTRL9_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL8_GC_RBB2_SHIFT           (4)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL8_GC_RBB2_MASK            (0x07 << RF_RBB_GAIN_INDEX3_GAIN_CTRL8_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX3_GAIN_CTRL8_GC_RBB1_MASK            (0x03)

#define RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB2_SHIFT          (28)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB1_SHIFT          (24)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB1_MASK           (0x03 << RF_RBB_GAIN_INDEX4_GAIN_CTRL15_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB2_SHIFT          (20)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB1_SHIFT          (16)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB1_MASK           (0x03 << RF_RBB_GAIN_INDEX4_GAIN_CTRL14_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB2_SHIFT          (12)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB1_SHIFT          (8)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB1_MASK           (0x03 << RF_RBB_GAIN_INDEX4_GAIN_CTRL13_GC_RBB1_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL12_GC_RBB2_SHIFT          (4)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL12_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX4_GAIN_CTRL12_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX4_GAIN_CTRL12_GC_RBB1_MASK           (0x03)

#define RF_RBB_GAIN_INDEX5_GAIN_CTRL16_GC_RBB2_SHIFT          (4)
#define RF_RBB_GAIN_INDEX5_GAIN_CTRL16_GC_RBB2_MASK           (0x07 << RF_RBB_GAIN_INDEX5_GAIN_CTRL16_GC_RBB2_SHIFT)
#define RF_RBB_GAIN_INDEX5_GAIN_CTRL16_GC_RBB1_MASK           (0x03)

#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_BOOST_SHIFT      (30)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_DAC_BIAS_SEL_SHIFT      (28)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX1_GAIN_CTRL1_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TMX_SHIFT            (24)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_SHIFT            (16)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_MASK             (0x1f << RF_TBB_GAIN_INDEX1_GAIN_CTRL1_GC_TBB_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TBB_BOOST_SHIFT      (14)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_DAC_BIAS_SEL_SHIFT      (12)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX1_GAIN_CTRL0_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TMX_SHIFT            (8)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX1_GAIN_CTRL0_GC_TBB_MASK             (0x1f)

#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_BOOST_SHIFT      (30)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_DAC_BIAS_SEL_SHIFT      (28)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX2_GAIN_CTRL3_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TMX_SHIFT            (24)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_SHIFT            (16)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_MASK             (0x1f << RF_TBB_GAIN_INDEX2_GAIN_CTRL3_GC_TBB_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TBB_BOOST_SHIFT      (14)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_DAC_BIAS_SEL_SHIFT      (12)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX2_GAIN_CTRL2_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TMX_SHIFT            (8)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX2_GAIN_CTRL2_GC_TBB_MASK             (0x1f)

#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_BOOST_SHIFT      (30)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_DAC_BIAS_SEL_SHIFT      (28)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX3_GAIN_CTRL5_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TMX_SHIFT            (24)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_SHIFT            (16)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_MASK             (0x1f << RF_TBB_GAIN_INDEX3_GAIN_CTRL5_GC_TBB_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TBB_BOOST_SHIFT      (14)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_DAC_BIAS_SEL_SHIFT      (12)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX3_GAIN_CTRL4_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TMX_SHIFT            (8)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX3_GAIN_CTRL4_GC_TBB_MASK             (0x1f)

#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_BOOST_SHIFT      (30)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_DAC_BIAS_SEL_SHIFT      (28)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX4_GAIN_CTRL7_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TMX_SHIFT            (24)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_SHIFT            (16)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_MASK             (0x1f << RF_TBB_GAIN_INDEX4_GAIN_CTRL7_GC_TBB_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TBB_BOOST_SHIFT      (14)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TBB_BOOST_MASK       (0x03 << RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TBB_BOOST_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_DAC_BIAS_SEL_SHIFT      (12)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_DAC_BIAS_SEL_MASK       (0x03 << RF_TBB_GAIN_INDEX4_GAIN_CTRL6_DAC_BIAS_SEL_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TMX_SHIFT            (8)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TMX_MASK             (0x07 << RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TMX_SHIFT)
#define RF_TBB_GAIN_INDEX4_GAIN_CTRL6_GC_TBB_MASK             (0x1f)

#define RF_PA_REG_CTRL_HW1_PA_VBCAS_11N_SHIFT                 (20)
#define RF_PA_REG_CTRL_HW1_PA_VBCAS_11N_MASK                  (0x07 << RF_PA_REG_CTRL_HW1_PA_VBCAS_11N_SHIFT)
#define RF_PA_REG_CTRL_HW1_PA_VBCORE_11N_SHIFT                (16)
#define RF_PA_REG_CTRL_HW1_PA_VBCORE_11N_MASK                 (0x0f << RF_PA_REG_CTRL_HW1_PA_VBCORE_11N_SHIFT)
#define RF_PA_REG_CTRL_HW1_PA_IET_11N_SHIFT                   (12)
#define RF_PA_REG_CTRL_HW1_PA_IET_11N_MASK                    (0x0f << RF_PA_REG_CTRL_HW1_PA_IET_11N_SHIFT)

