apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2464_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2464_MASK           (0xff << RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2464_SHIFT)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_IDAC_CW_2464_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_IDAC_CW_2464_MASK           (0x1f << RF_LO_CAL_CTRL_HW8_LO_VCO_IDAC_CW_2464_SHIFT)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2460_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2460_MASK           (0xff << RF_LO_CAL_CTRL_HW8_LO_VCO_FREQ_CW_2460_SHIFT)
#define RF_LO_CAL_CTRL_HW8_LO_VCO_IDAC_CW_2460_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2472_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2472_MASK           (0xff << RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2472_SHIFT)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_IDAC_CW_2472_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_IDAC_CW_2472_MASK           (0x1f << RF_LO_CAL_CTRL_HW9_LO_VCO_IDAC_CW_2472_SHIFT)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2468_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2468_MASK           (0xff << RF_LO_CAL_CTRL_HW9_LO_VCO_FREQ_CW_2468_SHIFT)
#define RF_LO_CAL_CTRL_HW9_LO_VCO_IDAC_CW_2468_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2480_SHIFT         (24)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2480_MASK          (0xff << RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2480_SHIFT)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_IDAC_CW_2480_SHIFT         (16)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_IDAC_CW_2480_MASK          (0x1f << RF_LO_CAL_CTRL_HW10_LO_VCO_IDAC_CW_2480_SHIFT)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2476_SHIFT         (8)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2476_MASK          (0xff << RF_LO_CAL_CTRL_HW10_LO_VCO_FREQ_CW_2476_SHIFT)
#define RF_LO_CAL_CTRL_HW10_LO_VCO_IDAC_CW_2476_MASK          (0x1f)

#define RF_LO_CAL_CTRL_HW11_LO_VCO_FREQ_CW_2484_SHIFT         (8)
#define RF_LO_CAL_CTRL_HW11_LO_VCO_FREQ_CW_2484_MASK          (0xff << RF_LO_CAL_CTRL_HW11_LO_VCO_FREQ_CW_2484_SHIFT)
#define RF_LO_CAL_CTRL_HW11_LO_VCO_IDAC_CW_2484_MASK          (0x1f)

#define RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC1_SHIFT                 (24)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC1_MASK                  (0x3f << RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC1_SHIFT)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_I_GC1_SHIFT                 (16)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_I_GC1_MASK                  (0x3f << RF_ROSDAC_CTRL_HW1_ROSDAC_I_GC1_SHIFT)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC0_SHIFT                 (8)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC0_MASK                  (0x3f << RF_ROSDAC_CTRL_HW1_ROSDAC_Q_GC0_SHIFT)
#define RF_ROSDAC_CTRL_HW1_ROSDAC_I_GC0_MASK                  (0x3f)

#define RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC3_SHIFT                 (24)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC3_MASK                  (0x3f << RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC3_SHIFT)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_I_GC3_SHIFT                 (16)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_I_GC3_MASK                  (0x3f << RF_ROSDAC_CTRL_HW2_ROSDAC_I_GC3_SHIFT)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC2_SHIFT                 (8)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC2_MASK                  (0x3f << RF_ROSDAC_CTRL_HW2_ROSDAC_Q_GC2_SHIFT)
#define RF_ROSDAC_CTRL_HW2_ROSDAC_I_GC2_MASK                  (0x3f)

#define RF_RXIQ_CTRL_HW1_RX_IQ_GAIN_COMP_GC0_SHIFT            (16)
#define RF_RXIQ_CTRL_HW1_RX_IQ_GAIN_COMP_GC0_MASK             (0x7ff << RF_RXIQ_CTRL_HW1_RX_IQ_GAIN_COMP_GC0_SHIFT)
#define RF_RXIQ_CTRL_HW1_RX_IQ_PHASE_COMP_GC0_MASK            (0x3ff)

#define RF_RXIQ_CTRL_HW2_RX_IQ_GAIN_COMP_GC1_SHIFT            (16)
#define RF_RXIQ_CTRL_HW2_RX_IQ_GAIN_COMP_GC1_MASK             (0x7ff << RF_RXIQ_CTRL_HW2_RX_IQ_GAIN_COMP_GC1_SHIFT)
#define RF_RXIQ_CTRL_HW2_RX_IQ_PHASE_COMP_GC1_MASK            (0x3ff)

#define RF_RXIQ_CTRL_HW3_RX_IQ_GAIN_COMP_GC2_SHIFT            (16)
#define RF_RXIQ_CTRL_HW3_RX_IQ_GAIN_COMP_GC2_MASK             (0x7ff << RF_RXIQ_CTRL_HW3_RX_IQ_GAIN_COMP_GC2_SHIFT)
#define RF_RXIQ_CTRL_HW3_RX_IQ_PHASE_COMP_GC2_MASK            (0x3ff)

#define RF_RXIQ_CTRL_HW4_RX_IQ_GAIN_COMP_GC3_SHIFT            (16)
#define RF_RXIQ_CTRL_HW4_RX_IQ_GAIN_COMP_GC3_MASK             (0x7ff << RF_RXIQ_CTRL_HW4_RX_IQ_GAIN_COMP_GC3_SHIFT)
#define RF_RXIQ_CTRL_HW4_RX_IQ_PHASE_COMP_GC3_MASK            (0x3ff)

#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC1_SHIFT             (24)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC1_MASK              (0x3f << RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC1_SHIFT)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_I_GC1_SHIFT             (16)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_I_GC1_MASK              (0x3f << RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_I_GC1_SHIFT)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC0_SHIFT             (8)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC0_MASK              (0x3f << RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_Q_GC0_SHIFT)
#define RF_TOSDAC_CTRL_HW1_TBB_TOSDAC_I_GC0_MASK              (0x3f)

#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC3_SHIFT             (24)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC3_MASK              (0x3f << RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC3_SHIFT)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_I_GC3_SHIFT             (16)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_I_GC3_MASK              (0x3f << RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_I_GC3_SHIFT)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC2_SHIFT             (8)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC2_MASK              (0x3f << RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_Q_GC2_SHIFT)
#define RF_TOSDAC_CTRL_HW2_TBB_TOSDAC_I_GC2_MASK              (0x3f)

#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC5_SHIFT             (24)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC5_MASK              (0x3f << RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC5_SHIFT)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_I_GC5_SHIFT             (16)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_I_GC5_MASK              (0x3f << RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_I_GC5_SHIFT)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC4_SHIFT             (8)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC4_MASK              (0x3f << RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_Q_GC4_SHIFT)
#define RF_TOSDAC_CTRL_HW3_TBB_TOSDAC_I_GC4_MASK              (0x3f)

