apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC7_SHIFT             (24)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC7_MASK              (0x3f << RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC7_SHIFT)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_I_GC7_SHIFT             (16)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_I_GC7_MASK              (0x3f << RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_I_GC7_SHIFT)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC6_SHIFT             (8)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC6_MASK              (0x3f << RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_Q_GC6_SHIFT)
#define RF_TOSDAC_CTRL_HW4_TBB_TOSDAC_I_GC6_MASK              (0x3f)

#define RF_TX_IQ_GAIN_HW0_TX_IQ_GAIN_COMP_GC0_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW0_TX_IQ_GAIN_COMP_GC0_MASK            (0x7ff << RF_TX_IQ_GAIN_HW0_TX_IQ_GAIN_COMP_GC0_SHIFT)
#define RF_TX_IQ_GAIN_HW0_TX_IQ_PHASE_COMP_GC0_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW1_TX_IQ_GAIN_COMP_GC1_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW1_TX_IQ_GAIN_COMP_GC1_MASK            (0x7ff << RF_TX_IQ_GAIN_HW1_TX_IQ_GAIN_COMP_GC1_SHIFT)
#define RF_TX_IQ_GAIN_HW1_TX_IQ_PHASE_COMP_GC1_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW2_TX_IQ_GAIN_COMP_GC2_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW2_TX_IQ_GAIN_COMP_GC2_MASK            (0x7ff << RF_TX_IQ_GAIN_HW2_TX_IQ_GAIN_COMP_GC2_SHIFT)
#define RF_TX_IQ_GAIN_HW2_TX_IQ_PHASE_COMP_GC2_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW3_TX_IQ_GAIN_COMP_GC3_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW3_TX_IQ_GAIN_COMP_GC3_MASK            (0x7ff << RF_TX_IQ_GAIN_HW3_TX_IQ_GAIN_COMP_GC3_SHIFT)
#define RF_TX_IQ_GAIN_HW3_TX_IQ_PHASE_COMP_GC3_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW4_TX_IQ_GAIN_COMP_GC4_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW4_TX_IQ_GAIN_COMP_GC4_MASK            (0x7ff << RF_TX_IQ_GAIN_HW4_TX_IQ_GAIN_COMP_GC4_SHIFT)
#define RF_TX_IQ_GAIN_HW4_TX_IQ_PHASE_COMP_GC4_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW5_TX_IQ_GAIN_COMP_GC5_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW5_TX_IQ_GAIN_COMP_GC5_MASK            (0x7ff << RF_TX_IQ_GAIN_HW5_TX_IQ_GAIN_COMP_GC5_SHIFT)
#define RF_TX_IQ_GAIN_HW5_TX_IQ_PHASE_COMP_GC5_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW6_TX_IQ_GAIN_COMP_GC6_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW6_TX_IQ_GAIN_COMP_GC6_MASK            (0x7ff << RF_TX_IQ_GAIN_HW6_TX_IQ_GAIN_COMP_GC6_SHIFT)
#define RF_TX_IQ_GAIN_HW6_TX_IQ_PHASE_COMP_GC6_MASK           (0x3ff)

#define RF_TX_IQ_GAIN_HW7_TX_IQ_GAIN_COMP_GC7_SHIFT           (16)
#define RF_TX_IQ_GAIN_HW7_TX_IQ_GAIN_COMP_GC7_MASK            (0x7ff << RF_TX_IQ_GAIN_HW7_TX_IQ_GAIN_COMP_GC7_SHIFT)
#define RF_TX_IQ_GAIN_HW7_TX_IQ_PHASE_COMP_GC7_MASK           (0x3ff)

#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2484_SHIFT  (26)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2484_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2484_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2472_SHIFT  (24)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2472_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2472_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2467_SHIFT  (22)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2467_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2467_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2462_SHIFT  (20)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2462_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2462_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2457_SHIFT  (18)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2457_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2457_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2452_SHIFT  (16)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2452_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2452_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2447_SHIFT  (14)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2447_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2447_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2442_SHIFT  (12)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2442_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2442_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2437_SHIFT  (10)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2437_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2437_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2432_SHIFT  (8)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2432_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2432_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2427_SHIFT  (6)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2427_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2427_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2422_SHIFT  (4)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2422_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2422_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2417_SHIFT  (2)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2417_MASK   (0x03 << RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2417_SHIFT)
#define RF_LO_SDM_CTRL_HW1_LO_SDM_DITHER_SEL_WLAN_2412_MASK   (0x03)

#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2432_SHIFT   (30)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2432_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2432_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2430_SHIFT   (28)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2430_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2430_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2428_SHIFT   (26)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2428_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2428_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2426_SHIFT   (24)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2426_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2426_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2424_SHIFT   (22)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2424_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2424_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2422_SHIFT   (20)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2422_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2422_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2420_SHIFT   (18)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2420_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2420_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2418_SHIFT   (16)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2418_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2418_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2416_SHIFT   (14)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2416_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2416_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2414_SHIFT   (12)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2414_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2414_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2412_SHIFT   (10)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2412_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2412_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2410_SHIFT   (8)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2410_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2410_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2408_SHIFT   (6)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2408_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2408_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2406_SHIFT   (4)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2406_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2406_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2404_SHIFT   (2)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2404_MASK    (0x03 << RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2404_SHIFT)
#define RF_LO_SDM_CTRL_HW2_LO_SDM_DITHER_SEL_BLE_2402_MASK    (0x03)

#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2464_SHIFT   (30)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2464_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2464_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2462_SHIFT   (28)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2462_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2462_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2460_SHIFT   (26)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2460_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2460_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2458_SHIFT   (24)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2458_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2458_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2456_SHIFT   (22)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2456_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2456_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2454_SHIFT   (20)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2454_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2454_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2452_SHIFT   (18)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2452_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2452_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2450_SHIFT   (16)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2450_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2450_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2448_SHIFT   (14)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2448_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2448_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2446_SHIFT   (12)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2446_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2446_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2444_SHIFT   (10)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2444_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2444_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2442_SHIFT   (8)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2442_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2442_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2440_SHIFT   (6)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2440_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2440_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2438_SHIFT   (4)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2438_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2438_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2436_SHIFT   (2)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2436_MASK    (0x03 << RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2436_SHIFT)
#define RF_LO_SDM_CTRL_HW3_LO_SDM_DITHER_SEL_BLE_2434_MASK    (0x03)

#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_TX_SHIFT     (16)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_TX_MASK      (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_TX_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2480_SHIFT   (14)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2480_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2480_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2478_SHIFT   (12)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2478_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2478_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2476_SHIFT   (10)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2476_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2476_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2474_SHIFT   (8)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2474_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2474_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2472_SHIFT   (6)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2472_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2472_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2470_SHIFT   (4)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2470_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2470_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2468_SHIFT   (2)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2468_MASK    (0x03 << RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2468_SHIFT)
#define RF_LO_SDM_CTRL_HW4_LO_SDM_DITHER_SEL_BLE_2466_MASK    (0x03)

#define RF_LO_SDM_CTRL_HW5_LO_SDM_BYPASS_MODE_SHIFT           (12)
#define RF_LO_SDM_CTRL_HW5_LO_SDM_BYPASS_MODE_MASK            (0x3f << RF_LO_SDM_CTRL_HW5_LO_SDM_BYPASS_MODE_SHIFT)
#define RF_LO_SDM_CTRL_HW5_LO_CENTER_FREQ_MHZ_MASK            (0xfff)

#define RF_LO_SDM_CTRL_HW6_LO_SDMIN_CENTER_MASK               (0x1fffffff)

