apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_LO_SDM_CTRL_HW7_LO_SDMIN_1M_MASK                   (0xfffff)

#define RF_LO_SDM_CTRL_HW8_LO_SDMIN_IF_MASK                   (0xfffff)

#define RF_RBB_BW_CTRL_HW_RBB_BT_MODE_BLE                     (1 << 0)

#define RF_SINGEN_CTRL0_SINGEN_EN                             (1 << 31)
#define RF_SINGEN_CTRL0_SINGEN_CLKDIV_N_SHIFT                 (29)
#define RF_SINGEN_CTRL0_SINGEN_CLKDIV_N_MASK                  (0x03 << RF_SINGEN_CTRL0_SINGEN_CLKDIV_N_SHIFT)
#define RF_SINGEN_CTRL0_SINGEN_UNSIGN_EN                      (1 << 28)
#define RF_SINGEN_CTRL0_SINGEN_INC_STEP0_SHIFT                (16)
#define RF_SINGEN_CTRL0_SINGEN_INC_STEP0_MASK                 (0x3ff << RF_SINGEN_CTRL0_SINGEN_INC_STEP0_SHIFT)
#define RF_SINGEN_CTRL0_SINGEN_INC_STEP1_MASK                 (0x3ff)

#define RF_SINGEN_CTRL1_SINGEN_MODE_I_SHIFT                   (28)
#define RF_SINGEN_CTRL1_SINGEN_MODE_I_MASK                    (0x0f << RF_SINGEN_CTRL1_SINGEN_MODE_I_SHIFT)
#define RF_SINGEN_CTRL1_SINGEN_CLKDIV_I_SHIFT                 (16)
#define RF_SINGEN_CTRL1_SINGEN_CLKDIV_I_MASK                  (0x3ff << RF_SINGEN_CTRL1_SINGEN_CLKDIV_I_SHIFT)
#define RF_SINGEN_CTRL1_SINGEN_MODE_Q_SHIFT                   (12)
#define RF_SINGEN_CTRL1_SINGEN_MODE_Q_MASK                    (0x0f << RF_SINGEN_CTRL1_SINGEN_MODE_Q_SHIFT)
#define RF_SINGEN_CTRL1_SINGEN_CLKDIV_Q_MASK                  (0x3ff)

#define RF_SINGEN_CTRL2_SINGEN_START_ADDR0_I_SHIFT            (22)
#define RF_SINGEN_CTRL2_SINGEN_START_ADDR0_I_MASK             (0x3ff << RF_SINGEN_CTRL2_SINGEN_START_ADDR0_I_SHIFT)
#define RF_SINGEN_CTRL2_SINGEN_START_ADDR1_I_SHIFT            (12)
#define RF_SINGEN_CTRL2_SINGEN_START_ADDR1_I_MASK             (0x3ff << RF_SINGEN_CTRL2_SINGEN_START_ADDR1_I_SHIFT)
#define RF_SINGEN_CTRL2_SINGEN_GAIN_I_MASK                    (0x7ff)

#define RF_SINGEN_CTRL3_SINGEN_START_ADDR0_Q_SHIFT            (22)
#define RF_SINGEN_CTRL3_SINGEN_START_ADDR0_Q_MASK             (0x3ff << RF_SINGEN_CTRL3_SINGEN_START_ADDR0_Q_SHIFT)
#define RF_SINGEN_CTRL3_SINGEN_START_ADDR1_Q_SHIFT            (12)
#define RF_SINGEN_CTRL3_SINGEN_START_ADDR1_Q_MASK             (0x3ff << RF_SINGEN_CTRL3_SINGEN_START_ADDR1_Q_SHIFT)
#define RF_SINGEN_CTRL3_SINGEN_GAIN_Q_MASK                    (0x7ff)

#define RF_SINGEN_CTRL4_SINGEN_FIX_EN_I                       (1 << 28)
#define RF_SINGEN_CTRL4_SINGEN_FIX_I_SHIFT                    (16)
#define RF_SINGEN_CTRL4_SINGEN_FIX_I_MASK                     (0xfff << RF_SINGEN_CTRL4_SINGEN_FIX_I_SHIFT)
#define RF_SINGEN_CTRL4_SINGEN_FIX_EN_Q                       (1 << 12)
#define RF_SINGEN_CTRL4_SINGEN_FIX_Q_MASK                     (0xfff)

#define RF_RFIF_DFE_CTRL0_TEST_SEL_SHIFT                      (28)
#define RF_RFIF_DFE_CTRL0_TEST_SEL_MASK                       (0x0f << RF_RFIF_DFE_CTRL0_TEST_SEL_SHIFT)
#define RF_RFIF_DFE_CTRL0_BBMODE_4S_EN                        (1 << 27)
#define RF_RFIF_DFE_CTRL0_BBMODE_4S                           (1 << 26)
#define RF_RFIF_DFE_CTRL0_WIFIMODE_4S_EN                      (1 << 25)
#define RF_RFIF_DFE_CTRL0_WIFIMODE_4S_SHIFT                   (23)
#define RF_RFIF_DFE_CTRL0_WIFIMODE_4S_MASK                    (0x03 << RF_RFIF_DFE_CTRL0_WIFIMODE_4S_SHIFT)
#define RF_RFIF_DFE_CTRL0_RF_CH_IND_BLE_4S_EN                 (1 << 22)
#define RF_RFIF_DFE_CTRL0_RF_CH_IND_BLE_4S_SHIFT              (15)
#define RF_RFIF_DFE_CTRL0_RF_CH_IND_BLE_4S_MASK               (0x7f << RF_RFIF_DFE_CTRL0_RF_CH_IND_BLE_4S_SHIFT)
#define RF_RFIF_DFE_CTRL0_PAD_DAC_CLKOUT_INV_EN               (1 << 14)
#define RF_RFIF_DFE_CTRL0_PAD_ADC_CLKOUT_INV_EN               (1 << 13)
#define RF_RFIF_DFE_CTRL0_TX_TEST_SEL_SHIFT                   (11)
#define RF_RFIF_DFE_CTRL0_TX_TEST_SEL_MASK                    (0x03 << RF_RFIF_DFE_CTRL0_TX_TEST_SEL_SHIFT)
#define RF_RFIF_DFE_CTRL0_RX_TEST_SEL_SHIFT                   (9)
#define RF_RFIF_DFE_CTRL0_RX_TEST_SEL_MASK                    (0x03 << RF_RFIF_DFE_CTRL0_RX_TEST_SEL_SHIFT)
#define RF_RFIF_DFE_CTRL0_TX_DFE_EN_4S_EN                     (1 << 8)
#define RF_RFIF_DFE_CTRL0_TX_DFE_EN_4S                        (1 << 7)
#define RF_RFIF_DFE_CTRL0_RX_DFE_EN_4S_EN                     (1 << 6)
#define RF_RFIF_DFE_CTRL0_RX_DFE_EN_4S                        (1 << 5)
#define RF_RFIF_DFE_CTRL0_RFCKG_DAC_AFIFO_INV                 (1 << 4)
#define RF_RFIF_DFE_CTRL0_RFCKG_ADC_CLKOUT_SEL                (1 << 3)
#define RF_RFIF_DFE_CTRL0_RFCKG_ADC_AFIFO_INV                 (1 << 2)
#define RF_RFIF_DFE_CTRL0_RFCKG_TXCLK_4S_ON                   (1 << 1)
#define RF_RFIF_DFE_CTRL0_RFCKG_RXCLK_4S_ON                   (1 << 0)

#define RF_RFIF_DIG_CTRL_RFIF_PPUD_MANAUAL_EN                 (1 << 30)
#define RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT1_SHIFT                 (25)
#define RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT1_MASK                  (0x1f << RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT1_SHIFT)
#define RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT2_SHIFT                 (16)
#define RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT2_MASK                  (0x1ff << RF_RFIF_DIG_CTRL_RFIF_PPUD_CNT2_SHIFT)
#define RF_RFIF_DIG_CTRL_RFIF_INT_LO_UNLOCKED_MASK            (1 << 3)
#define RF_RFIF_DIG_CTRL_RFCKG_RXCLK_DIV2_MODE                (1 << 2)
#define RF_RFIF_DIG_CTRL_TEST_GC_FROM_PAD_EN                  (1 << 1)
#define RF_RFIF_DIG_CTRL_TEST_FROM_PAD_EN                     (1 << 0)

#define RF_SRAM_CTRL0_RF_SRAM_EXT_CLR                         (1 << 19)
#define RF_SRAM_CTRL0_RF_SRAM_SWAP                            (1 << 18)
#define RF_SRAM_CTRL0_RF_SRAM_LINK_MODE_SHIFT                 (16)
#define RF_SRAM_CTRL0_RF_SRAM_LINK_MODE_MASK                  (0x03 << RF_SRAM_CTRL0_RF_SRAM_LINK_MODE_SHIFT)
#define RF_SRAM_CTRL0_RF_SRAM_LINK_DLY_MASK                   (0xffff)

#define RF_SRAM_CTRL1_RF_SRAM_ADC_DONE_CNT_SHIFT              (16)
#define RF_SRAM_CTRL1_RF_SRAM_ADC_DONE_CNT_MASK               (0xffff << RF_SRAM_CTRL1_RF_SRAM_ADC_DONE_CNT_SHIFT)
#define RF_SRAM_CTRL1_RF_SRAM_ADC_STS_CLR                     (1 << 3)
#define RF_SRAM_CTRL1_RF_SRAM_ADC_LOOP_EN                     (1 << 2)
#define RF_SRAM_CTRL1_RF_SRAM_ADC_EN                          (1 << 1)
#define RF_SRAM_CTRL1_RF_SRAM_ADC_DONE                        (1 << 0)

#define RF_SRAM_CTRL2_RF_SRAM_ADC_ADDR_START_SHIFT            (16)
#define RF_SRAM_CTRL2_RF_SRAM_ADC_ADDR_START_MASK             (0xffff << RF_SRAM_CTRL2_RF_SRAM_ADC_ADDR_START_SHIFT)
#define RF_SRAM_CTRL2_RF_SRAM_ADC_ADDR_END_MASK               (0xffff)

