apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_rf.h
#define RF_SRAM_CTRL4_RF_SRAM_DAC_DONE_CNT_SHIFT              (16)
#define RF_SRAM_CTRL4_RF_SRAM_DAC_DONE_CNT_MASK               (0xffff << RF_SRAM_CTRL4_RF_SRAM_DAC_DONE_CNT_SHIFT)
#define RF_SRAM_CTRL4_RF_SRAM_DAC_STS_CLR                     (1 << 3)
#define RF_SRAM_CTRL4_RF_SRAM_DAC_LOOP_EN                     (1 << 2)
#define RF_SRAM_CTRL4_RF_SRAM_DAC_EN                          (1 << 1)
#define RF_SRAM_CTRL4_RF_SRAM_DAC_DONE                        (1 << 0)

#define RF_SRAM_CTRL5_RF_SRAM_DAC_ADDR_START_SHIFT            (16)
#define RF_SRAM_CTRL5_RF_SRAM_DAC_ADDR_START_MASK             (0xffff << RF_SRAM_CTRL5_RF_SRAM_DAC_ADDR_START_SHIFT)
#define RF_SRAM_CTRL5_RF_SRAM_DAC_ADDR_END_MASK               (0xffff)

#define RF_ICAL_CTRL0_RF_ICAL_F_UD_INV_EN                     (1 << 31)
#define RF_ICAL_CTRL0_RF_ICAL_A_UD_INV_EN                     (1 << 30)
#define RF_ICAL_CTRL0_RF_ICAL_F_CNT_N_SHIFT                   (20)
#define RF_ICAL_CTRL0_RF_ICAL_F_CNT_N_MASK                    (0x3ff << RF_ICAL_CTRL0_RF_ICAL_F_CNT_N_SHIFT)
#define RF_ICAL_CTRL0_RF_ICAL_A_CNT_N_SHIFT                   (10)
#define RF_ICAL_CTRL0_RF_ICAL_A_CNT_N_MASK                    (0x3ff << RF_ICAL_CTRL0_RF_ICAL_A_CNT_N_SHIFT)
#define RF_ICAL_CTRL0_RF_ICAL_R_CNT_N_MASK                    (0x3ff)

#define RF_ICAL_CTRL1_RF_ICAL_R_OS_I_SHIFT                    (20)
#define RF_ICAL_CTRL1_RF_ICAL_R_OS_I_MASK                     (0x3ff << RF_ICAL_CTRL1_RF_ICAL_R_OS_I_SHIFT)
#define RF_ICAL_CTRL1_RF_ICAL_R_OS_Q_SHIFT                    (10)
#define RF_ICAL_CTRL1_RF_ICAL_R_OS_Q_MASK                     (0x3ff << RF_ICAL_CTRL1_RF_ICAL_R_OS_Q_SHIFT)
#define RF_ICAL_CTRL1_RF_ICAL_R_AVG_N_MASK                    (0x1f)

#define RF_ICAL_CTRL2_RF_ICAL_PERIOD_N_MASK                   (0xffff)

#define RF_FSM_CTRL0_RF_CH_IND_WIFI_MASK                      (0xfff)

#define RF_FSM_CTRL1_RF_FSM_PU_PA_DLY_N_SHIFT                 (20)
#define RF_FSM_CTRL1_RF_FSM_PU_PA_DLY_N_MASK                  (0x3ff << RF_FSM_CTRL1_RF_FSM_PU_PA_DLY_N_SHIFT)
#define RF_FSM_CTRL1_RF_FSM_LO_RDY_SBCLR                      (1 << 19)
#define RF_FSM_CTRL1_RF_FSM_LO_RDY_4S_1                       (1 << 18)
#define RF_FSM_CTRL1_RF_FSM_LO_RDY_RST                        (1 << 17)
#define RF_FSM_CTRL1_RF_FSM_LO_RDY                            (1 << 16)
#define RF_FSM_CTRL1_RF_FSM_LO_TIME_MASK                      (0xffff)

#define RF_FSM_CTRL2_RF_FSM_DFE_RX_DLY_N_SHIFT                (20)
#define RF_FSM_CTRL2_RF_FSM_DFE_RX_DLY_N_MASK                 (0x3ff << RF_FSM_CTRL2_RF_FSM_DFE_RX_DLY_N_SHIFT)
#define RF_FSM_CTRL2_RF_FSM_DFE_TX_DLY_N_SHIFT                (10)
#define RF_FSM_CTRL2_RF_FSM_DFE_TX_DLY_N_MASK                 (0x3ff << RF_FSM_CTRL2_RF_FSM_DFE_TX_DLY_N_SHIFT)
#define RF_FSM_CTRL2_RF_TRX_BLE_4S_EN                         (1 << 6)
#define RF_FSM_CTRL2_RF_TRX_SW_BLE_4S                         (1 << 5)
#define RF_FSM_CTRL2_RF_TRX_EN_BLE_4S                         (1 << 4)
#define RF_FSM_CTRL2_RF_FSM_ST_DBG_EN                         (1 << 3)
#define RF_FSM_CTRL2_RF_FSM_ST_DBG_MASK                       (0x07)

#define RF_PKDET_CTRL0_PKDET_OUT_MODE                         (1 << 5)
#define RF_PKDET_CTRL0_PKDET_OUT_CNT_EN                       (1 << 4)
#define RF_PKDET_CTRL0_PKDET_OUT_CNT_STS_MASK                 (0x0f)

#define RF_DFE_CTRL_0_TX_DVGA_GAIN_CTRL_HW                    (1 << 31)
#define RF_DFE_CTRL_0_TX_DVGA_GAIN_QDB_SHIFT                  (24)
#define RF_DFE_CTRL_0_TX_DVGA_GAIN_QDB_MASK                   (0x7f << RF_DFE_CTRL_0_TX_DVGA_GAIN_QDB_SHIFT)
#define RF_DFE_CTRL_0_TX_IQC_GAIN_EN                          (1 << 23)
#define RF_DFE_CTRL_0_TX_IQC_GAIN_SHIFT                       (12)
#define RF_DFE_CTRL_0_TX_IQC_GAIN_MASK                        (0x7ff << RF_DFE_CTRL_0_TX_IQC_GAIN_SHIFT)
#define RF_DFE_CTRL_0_TX_IQC_PHASE_EN                         (1 << 10)
#define RF_DFE_CTRL_0_TX_IQC_PHASE_MASK                       (0x3ff)

#define RF_DFE_CTRL_1_TX_DAC_IQ_SWAP                          (1 << 31)
#define RF_DFE_CTRL_1_TX_DAC_DAT_FORMAT                       (1 << 30)
#define RF_DFE_CTRL_1_TX_DAC_OS_Q_SHIFT                       (16)
#define RF_DFE_CTRL_1_TX_DAC_OS_Q_MASK                        (0xfff << RF_DFE_CTRL_1_TX_DAC_OS_Q_SHIFT)
#define RF_DFE_CTRL_1_TX_DAC_OS_I_MASK                        (0xfff)

#define RF_DFE_CTRL_2_RX_ADC_IQ_SWAP                          (1 << 31)
#define RF_DFE_CTRL_2_RX_ADC_DAT_FORMAT                       (1 << 30)
#define RF_DFE_CTRL_2_RX_ADC_LOW_POW_EN                       (1 << 29)
#define RF_DFE_CTRL_2_RX_ADC_DCE_FLT_EN                       (1 << 28)
#define RF_DFE_CTRL_2_RX_ADC_OS_Q_SHIFT                       (16)
#define RF_DFE_CTRL_2_RX_ADC_OS_Q_MASK                        (0x3ff << RF_DFE_CTRL_2_RX_ADC_OS_Q_SHIFT)
#define RF_DFE_CTRL_2_RX_ADC_OS_I_MASK                        (0x3ff)

#define RF_DFE_CTRL_3_RX_ADC_4S_Q_EN                          (1 << 26)
#define RF_DFE_CTRL_3_RX_ADC_4S_Q_VAL_SHIFT                   (16)
#define RF_DFE_CTRL_3_RX_ADC_4S_Q_VAL_MASK                    (0x3ff << RF_DFE_CTRL_3_RX_ADC_4S_Q_VAL_SHIFT)
#define RF_DFE_CTRL_3_RX_ADC_4S_I_EN                          (1 << 10)
#define RF_DFE_CTRL_3_RX_ADC_4S_I_VAL_MASK                    (0x3ff)

#define RF_DFE_CTRL_4_RX_PF_I_EN                              (1 << 31)
#define RF_DFE_CTRL_4_RX_PF_Q_EN                              (1 << 30)
#define RF_DFE_CTRL_4_RX_PF_TH1_SHIFT                         (16)
#define RF_DFE_CTRL_4_RX_PF_TH1_MASK                          (0x3ff << RF_DFE_CTRL_4_RX_PF_TH1_SHIFT)
#define RF_DFE_CTRL_4_RX_PF_TH2_MASK                          (0x3ff)

#define RF_DFE_CTRL_5_RX_IQC_GAIN_EN                          (1 << 23)
#define RF_DFE_CTRL_5_RX_IQC_GAIN_SHIFT                       (12)
#define RF_DFE_CTRL_5_RX_IQC_GAIN_MASK                        (0x7ff << RF_DFE_CTRL_5_RX_IQC_GAIN_SHIFT)
#define RF_DFE_CTRL_5_RX_IQC_PHASE_EN                         (1 << 10)
#define RF_DFE_CTRL_5_RX_IQC_PHASE_MASK                       (0x3ff)

#define RF_DFE_CTRL_6_RX_PM_IN_SEL_SHIFT                      (30)
#define RF_DFE_CTRL_6_RX_PM_IN_SEL_MASK                       (0x03 << RF_DFE_CTRL_6_RX_PM_IN_SEL_SHIFT)
#define RF_DFE_CTRL_6_RX_PM_EN                                (1 << 29)
#define RF_DFE_CTRL_6_RX_PM_DONE                              (1 << 28)
#define RF_DFE_CTRL_6_RX_PM_FREQSHIFT_EN                      (1 << 20)
#define RF_DFE_CTRL_6_RX_PM_FREQSHIFT_CW_MASK                 (0xfffff)

#define RF_DFE_CTRL_7_RX_PM_ACC_LEN_SHIFT                     (16)
#define RF_DFE_CTRL_7_RX_PM_ACC_LEN_MASK                      (0xffff << RF_DFE_CTRL_7_RX_PM_ACC_LEN_SHIFT)
#define RF_DFE_CTRL_7_RX_PM_START_OFS_MASK                    (0xffff)

#define RF_DFE_CTRL_8_RX_PM_IQACC_I_MASK                      (0x1ffffff)

#define RF_DFE_CTRL_9_RX_PM_IQACC_Q_MASK                      (0x1ffffff)

#define RF_DFE_CTRL_10_DFE_DAC_RAW_Q_SHIFT                    (16)
#define RF_DFE_CTRL_10_DFE_DAC_RAW_Q_MASK                     (0x7ff << RF_DFE_CTRL_10_DFE_DAC_RAW_Q_SHIFT)
#define RF_DFE_CTRL_10_DFE_DAC_RAW_I_MASK                     (0x7ff)

#define RF_DFE_CTRL_11_DFE_ADC_RAW_Q_SHIFT                    (16)
#define RF_DFE_CTRL_11_DFE_ADC_RAW_Q_MASK                     (0x3ff << RF_DFE_CTRL_11_DFE_ADC_RAW_Q_SHIFT)
#define RF_DFE_CTRL_11_DFE_ADC_RAW_I_MASK                     (0x3ff)

#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC3_SHIFT             (24)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC3_MASK              (0x7f << RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC3_SHIFT)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC2_SHIFT             (16)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC2_MASK              (0x7f << RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC2_SHIFT)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC1_SHIFT             (8)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC1_MASK              (0x7f << RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC1_SHIFT)
#define RF_DFE_CTRL_12_TX_DVGA_GAIN_QDB_GC0_MASK              (0x7f)

#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC7_SHIFT             (24)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC7_MASK              (0x7f << RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC7_SHIFT)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC6_SHIFT             (16)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC6_MASK              (0x7f << RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC6_SHIFT)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC5_SHIFT             (8)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC5_MASK              (0x7f << RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC5_SHIFT)
#define RF_DFE_CTRL_13_TX_DVGA_GAIN_QDB_GC4_MASK              (0x7f)

#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC11_SHIFT            (24)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC11_MASK             (0x7f << RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC11_SHIFT)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC10_SHIFT            (16)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC10_MASK             (0x7f << RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC10_SHIFT)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC9_SHIFT             (8)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC9_MASK              (0x7f << RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC9_SHIFT)
#define RF_DFE_CTRL_14_TX_DVGA_GAIN_QDB_GC8_MASK              (0x7f)

#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC15_SHIFT            (24)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC15_MASK             (0x7f << RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC15_SHIFT)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC14_SHIFT            (16)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC14_MASK             (0x7f << RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC14_SHIFT)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC13_SHIFT            (8)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC13_MASK             (0x7f << RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC13_SHIFT)
#define RF_DFE_CTRL_15_TX_DVGA_GAIN_QDB_GC12_MASK             (0x7f)

#define RF_DFE_CTRL_16_RF_TBB_IND_GC7_SHIFT                   (28)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC7_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC7_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC6_SHIFT                   (24)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC6_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC6_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC5_SHIFT                   (20)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC5_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC5_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC4_SHIFT                   (16)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC4_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC4_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC3_SHIFT                   (12)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC3_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC3_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC2_SHIFT                   (8)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC2_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC2_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC1_SHIFT                   (4)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC1_MASK                    (0x07 << RF_DFE_CTRL_16_RF_TBB_IND_GC1_SHIFT)
#define RF_DFE_CTRL_16_RF_TBB_IND_GC0_MASK                    (0x07)

#define RF_DFE_CTRL_17_RF_TBB_IND_GC15_SHIFT                  (28)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC15_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC15_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC14_SHIFT                  (24)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC14_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC14_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC13_SHIFT                  (20)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC13_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC13_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC12_SHIFT                  (16)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC12_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC12_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC11_SHIFT                  (12)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC11_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC11_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC10_SHIFT                  (8)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC10_MASK                   (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC10_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC9_SHIFT                   (4)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC9_MASK                    (0x07 << RF_DFE_CTRL_17_RF_TBB_IND_GC9_SHIFT)
#define RF_DFE_CTRL_17_RF_TBB_IND_GC8_MASK                    (0x07)

#define RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC2_SHIFT         (16)
#define RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC2_MASK          (0x7f << RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC2_SHIFT)
#define RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC1_SHIFT         (8)
#define RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC1_MASK          (0x7f << RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC1_SHIFT)
#define RF_DFE_CTRL_18_TX_DVGA_GAIN_QDB_BLE_GC0_MASK          (0x7f)

#endif /* __ARCH_RISCV_SRC_HARDWARE_GLB_H */
